{
	"No workspace folders are open. Please open a workspace folder to use this extension": "No hay carpetas de espacio de trabajo abiertas. Abre una carpeta de espacio de trabajo para usar esta extensión",
	"Select a workspace folder to use. This folder will be used to load workspace-specific configuration for the extension": "Selecciona una carpeta de espacio de trabajo. Esa carpeta se usará para cargar la configuración específica de la extensión",
	"The {0} extension is now enabled and ready to use": "La extensión {0} está habilitada y lista para usarse",
	"The {0} extension is now disabled": "La extensión {0} está deshabilitada",
	"The {0} extension is disabled in settings. Enable it to use its features": "La extensión {0} está deshabilitada en la configuración. Habilítala para usar sus funciones",
	"Welcome to {0} version {1}! The extension is now active": "¡Bienvenida a {0} versión {1}! La extensión ya está activa",
	"The {0} extension has been updated. Check out what's new in version {1}": "La extensión {0} se ha actualizado. Consulta las novedades de la versión {1}",
	"Release Notes": "Notas de la versión",
	"Dismiss": "Descartar",
	"A new version of {0} is available. Update to version {1} now": "¡Hay una nueva versión de {0} disponible! Actualiza a la versión {1} ahora",
	"Update Now": "Actualizar ahora",
	"Report Issues": "Reportar Problemas",
	"Rate Us": "Califícanos",
	"Follow Us": "Síguenos",
	"Support Us": "Apóyanos",
	"Become a Sponsor": "Conviértete en Patrocinador",
	"Buy Me a Coffee": "Donar a través de Buy Me a Coffee",
	"Although {0} is offered at no cost, your support is deeply appreciated if you find it beneficial. Thank you for considering!": "Aunque {0} se ofrece de forma gratuita, tu apoyo es muy apreciado si lo encuentras útil. ¡Gracias por considerarlo!",
	"Select a workspace folder to use. This folder will be used to generate the file": "Selecciona una carpeta de espacio de trabajo para usar. Esta carpeta se utilizará para generar el archivo",
	"The workspace folder does not exist. Please select a valid workspace folder to use": "La carpeta de espacio de trabajo no existe. Selecciona una carpeta de espacio de trabajo válida para usar",
	"Enter the folder name where the file will be created": "Introduce el nombre de la carpeta donde se creará el archivo",
	"Enter the folder name, e.g. models, services, utils, etc": "Introduce el nombre de la carpeta, por ejemplo, models, services, utils, etc",
	"The folder name is invalid! Please enter a valid folder name": "¡El nombre de la carpeta no es válido! Por favor, introduce un nombre de carpeta válido",
	"Enter the component name": "Introduce el nombre del componente",
	"Enter the component name, e.g. User, Product, Order, etc": "Introduce el nombre del componente, por ejemplo, User, Product, Order, etc",
	"The component name is invalid! Please enter a valid name": "¡El nombre del componente no es válido! Por favor, introduce un nombre válido",
	"Select the template for the custom element generation": "Selecciona la plantilla para la generación del elemento personalizado",
	"The template for the custom component does not exist. Please try again": "La plantilla para el componente personalizado no existe. Por favor, inténtalo de nuevo",
	"The file has not been created! Please try again": "¡El archivo no se ha creado! Por favor, inténtalo de nuevo",
	"The {0} has been created successfully": "El {0} se ha creado correctamente",
	"File created successfully!": "¡Archivo creado correctamente!",
	"The file name already exists! Please enter a different name": "¡El nombre del archivo ya existe! Por favor, introduce un nombre diferente",
	"Select a package manager to install the {0} integration": "Selecciona un administrador de paquetes para instalar la integración {0}"
}
